artilleryTest.yml
config:
  target: "http://localhost:1337"
  phases:
    - duration: 60
      arrivalRate: 100

scenarios:
    - flow:
      - post: 
          url: "/view"
          json:
            body: '{"events":[{"videoId":12345,"viewInstanceId":92374985,"eventAction":"PLAY","event_timestamp":"2017-12-08 23:28:31+00:00"},{"videoId":12345,"viewInstanceId":92374985,"eventAction":"PAUSE","event_timestamp":"2017-12-08 23:33:31+00:00"},{"videoId":12345,"viewInstanceId":92374985,"eventAction":"END","event_timestamp":"2017-12-08 23:38:31+00:00"}]}'